zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/pio/sam4lc4c.h
#define GPIO_PC25B_EIC_EXTINT2   _UL(1 << 25)
#define PIN_PC25B_EIC_EXTINT_NUM        _L(2) /**< \brief EIC signal: PIN_PC25 External Interrupt Line */
#define PIN_PA05C_EIC_EXTINT3           _L(5) /**< \brief EIC signal: EXTINT3 on PA05 mux C */
#define MUX_PA05C_EIC_EXTINT3           _L(2)
#define PINMUX_PA05C_EIC_EXTINT3   ((PIN_PA05C_EIC_EXTINT3 << 16) | MUX_PA05C_EIC_EXTINT3)
#define GPIO_PA05C_EIC_EXTINT3   _UL(1 <<  5)
#define PIN_PA05C_EIC_EXTINT_NUM        _L(3) /**< \brief EIC signal: PIN_PA05 External Interrupt Line */
#define PIN_PA18C_EIC_EXTINT3          _L(18) /**< \brief EIC signal: EXTINT3 on PA18 mux C */
#define MUX_PA18C_EIC_EXTINT3           _L(2)
#define PINMUX_PA18C_EIC_EXTINT3   ((PIN_PA18C_EIC_EXTINT3 << 16) | MUX_PA18C_EIC_EXTINT3)
#define GPIO_PA18C_EIC_EXTINT3   _UL(1 << 18)
#define PIN_PA18C_EIC_EXTINT_NUM        _L(3) /**< \brief EIC signal: PIN_PA18 External Interrupt Line */
#define PIN_PC26B_EIC_EXTINT3          _L(90) /**< \brief EIC signal: EXTINT3 on PC26 mux B */
#define MUX_PC26B_EIC_EXTINT3           _L(1)
#define PINMUX_PC26B_EIC_EXTINT3   ((PIN_PC26B_EIC_EXTINT3 << 16) | MUX_PC26B_EIC_EXTINT3)
#define GPIO_PC26B_EIC_EXTINT3   _UL(1 << 26)
#define PIN_PC26B_EIC_EXTINT_NUM        _L(3) /**< \brief EIC signal: PIN_PC26 External Interrupt Line */
#define PIN_PA07C_EIC_EXTINT4           _L(7) /**< \brief EIC signal: EXTINT4 on PA07 mux C */
#define MUX_PA07C_EIC_EXTINT4           _L(2)
#define PINMUX_PA07C_EIC_EXTINT4   ((PIN_PA07C_EIC_EXTINT4 << 16) | MUX_PA07C_EIC_EXTINT4)
#define GPIO_PA07C_EIC_EXTINT4   _UL(1 <<  7)
#define PIN_PA07C_EIC_EXTINT_NUM        _L(4) /**< \brief EIC signal: PIN_PA07 External Interrupt Line */
#define PIN_PA19C_EIC_EXTINT4          _L(19) /**< \brief EIC signal: EXTINT4 on PA19 mux C */
#define MUX_PA19C_EIC_EXTINT4           _L(2)
#define PINMUX_PA19C_EIC_EXTINT4   ((PIN_PA19C_EIC_EXTINT4 << 16) | MUX_PA19C_EIC_EXTINT4)
#define GPIO_PA19C_EIC_EXTINT4   _UL(1 << 19)
#define PIN_PA19C_EIC_EXTINT_NUM        _L(4) /**< \brief EIC signal: PIN_PA19 External Interrupt Line */
#define PIN_PC27B_EIC_EXTINT4          _L(91) /**< \brief EIC signal: EXTINT4 on PC27 mux B */
#define MUX_PC27B_EIC_EXTINT4           _L(1)
#define PINMUX_PC27B_EIC_EXTINT4   ((PIN_PC27B_EIC_EXTINT4 << 16) | MUX_PC27B_EIC_EXTINT4)
#define GPIO_PC27B_EIC_EXTINT4   _UL(1 << 27)
#define PIN_PC27B_EIC_EXTINT_NUM        _L(4) /**< \brief EIC signal: PIN_PC27 External Interrupt Line */
#define PIN_PA20C_EIC_EXTINT5          _L(20) /**< \brief EIC signal: EXTINT5 on PA20 mux C */
#define MUX_PA20C_EIC_EXTINT5           _L(2)
#define PINMUX_PA20C_EIC_EXTINT5   ((PIN_PA20C_EIC_EXTINT5 << 16) | MUX_PA20C_EIC_EXTINT5)
#define GPIO_PA20C_EIC_EXTINT5   _UL(1 << 20)
#define PIN_PA20C_EIC_EXTINT_NUM        _L(5) /**< \brief EIC signal: PIN_PA20 External Interrupt Line */
#define PIN_PC03B_EIC_EXTINT5          _L(67) /**< \brief EIC signal: EXTINT5 on PC03 mux B */
#define MUX_PC03B_EIC_EXTINT5           _L(1)
#define PINMUX_PC03B_EIC_EXTINT5   ((PIN_PC03B_EIC_EXTINT5 << 16) | MUX_PC03B_EIC_EXTINT5)
#define GPIO_PC03B_EIC_EXTINT5   _UL(1 <<  3)
#define PIN_PC03B_EIC_EXTINT_NUM        _L(5) /**< \brief EIC signal: PIN_PC03 External Interrupt Line */
#define PIN_PA21C_EIC_EXTINT6          _L(21) /**< \brief EIC signal: EXTINT6 on PA21 mux C */
#define MUX_PA21C_EIC_EXTINT6           _L(2)
#define PINMUX_PA21C_EIC_EXTINT6   ((PIN_PA21C_EIC_EXTINT6 << 16) | MUX_PA21C_EIC_EXTINT6)
#define GPIO_PA21C_EIC_EXTINT6   _UL(1 << 21)
#define PIN_PA21C_EIC_EXTINT_NUM        _L(6) /**< \brief EIC signal: PIN_PA21 External Interrupt Line */
#define PIN_PC04B_EIC_EXTINT6          _L(68) /**< \brief EIC signal: EXTINT6 on PC04 mux B */
#define MUX_PC04B_EIC_EXTINT6           _L(1)
#define PINMUX_PC04B_EIC_EXTINT6   ((PIN_PC04B_EIC_EXTINT6 << 16) | MUX_PC04B_EIC_EXTINT6)
#define GPIO_PC04B_EIC_EXTINT6   _UL(1 <<  4)
#define PIN_PC04B_EIC_EXTINT_NUM        _L(6) /**< \brief EIC signal: PIN_PC04 External Interrupt Line */
#define PIN_PA22C_EIC_EXTINT7          _L(22) /**< \brief EIC signal: EXTINT7 on PA22 mux C */
#define MUX_PA22C_EIC_EXTINT7           _L(2)
#define PINMUX_PA22C_EIC_EXTINT7   ((PIN_PA22C_EIC_EXTINT7 << 16) | MUX_PA22C_EIC_EXTINT7)
#define GPIO_PA22C_EIC_EXTINT7   _UL(1 << 22)
#define PIN_PA22C_EIC_EXTINT_NUM        _L(7) /**< \brief EIC signal: PIN_PA22 External Interrupt Line */
#define PIN_PC05B_EIC_EXTINT7          _L(69) /**< \brief EIC signal: EXTINT7 on PC05 mux B */
#define MUX_PC05B_EIC_EXTINT7           _L(1)
#define PINMUX_PC05B_EIC_EXTINT7   ((PIN_PC05B_EIC_EXTINT7 << 16) | MUX_PC05B_EIC_EXTINT7)
#define GPIO_PC05B_EIC_EXTINT7   _UL(1 <<  5)
#define PIN_PC05B_EIC_EXTINT_NUM        _L(7) /**< \brief EIC signal: PIN_PC05 External Interrupt Line */
#define PIN_PA23C_EIC_EXTINT8          _L(23) /**< \brief EIC signal: EXTINT8 on PA23 mux C */
#define MUX_PA23C_EIC_EXTINT8           _L(2)
#define PINMUX_PA23C_EIC_EXTINT8   ((PIN_PA23C_EIC_EXTINT8 << 16) | MUX_PA23C_EIC_EXTINT8)
#define GPIO_PA23C_EIC_EXTINT8   _UL(1 << 23)
#define PIN_PA23C_EIC_EXTINT_NUM        _L(8) /**< \brief EIC signal: PIN_PA23 External Interrupt Line */
#define PIN_PC06B_EIC_EXTINT8          _L(70) /**< \brief EIC signal: EXTINT8 on PC06 mux B */
#define MUX_PC06B_EIC_EXTINT8           _L(1)
#define PINMUX_PC06B_EIC_EXTINT8   ((PIN_PC06B_EIC_EXTINT8 << 16) | MUX_PC06B_EIC_EXTINT8)
#define GPIO_PC06B_EIC_EXTINT8   _UL(1 <<  6)
#define PIN_PC06B_EIC_EXTINT_NUM        _L(8) /**< \brief EIC signal: PIN_PC06 External Interrupt Line */

#endif /* _SAM4LC4C_PIO_ */
